from addoutline import addtoc

table_of_contents='''第1部分 数理逻辑 1
 第1章 命题逻辑的基本概念 3
  1.1 命题与联结词 3
  1.2 命题公式及其赋值 9
  习题1 14
 第2章 命题逻辑等值演算 19
 第3章 命题逻辑的推理理论 46
 第4章 一阶逻辑基本概念 60
 第5章 一阶逻辑等值演算与推理 73
第2部分 集合论 89
 第6章 集合代数 91
 第7章 二元关系 110
 第8章 函数 145
第3部分 代数结构 175
 第9章 代数系统 177
 第10章 群与环 194
 第11章 格与布尔代数 220
第4部分 组合数学 235
 第12章 基本的组合技术公式 237
 第13章 递推方程与生成函数 253
第5部分 图论 291
 第14章 图的基本概念 293
 第15章 欧拉图与哈密顿图 316
 第16章 树 329
 第17章 平面图 344
 第18章 支配集、覆盖集、独立集、匹配与着色 356
第6部分 初等数论 369
 第19章 初等数论 371'''


addtoc(table_of_contents,"/Users/wangran/Desktop/123f.pdf",9)

